function antconc_ucs8(antconc_text, isAffix){
    var ucs8_text = antconc_text;

    var A = [
        [/\{/g,    ' (('], // \{  ((
        [/\}/g,    '))'],  // \} ))
        [/@/g,      '\u00b0'], // @ °
        [/([\u047f\u0444\u0471])~/g,   '$1\\'], // (?<=[ѿфѱ])~ \\
        [/\u0482/g,  '\xa4'] // ҂ ¤
    ];

    var B = [ // Правила создания придыханий
        [/((^[=][\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][=][\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a]))(.|$)/g, '$1\u4444$4'], // ((?<=^[=][аеєиіоꙋѹуѡыѣюꙗѧѵѻАЕИІОꙊѸѠЫѢЮꙖѦѴѺ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][=][аеєиіоꙋѹуѡыѣюꙗѧѵѻАЕИІОꙊѸѠЫѢЮꙖѦѴѺ]))(?P<symb>.|$) --> 䑄\g<symb>
        [/((^[\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b]))(?![\u4444'`\^])/g, '$13'], // ((?<=^[аеєиіоꙋѹуѡыѣюꙗѧѵѻ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][аеєиіоꙋѹуѡыѣюꙗѧѵѻ]))(?![䑄'`\^]) --> 3
        [/((^[\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b]))'/g, '$14'], // ((?<=^[аеєиіоꙋѹуѡыѣюꙗѧѵѻ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][аеєиіоꙋѹуѡыѣюꙗѧѵѻ]))' --> 4
        [/((^[\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][\u0430\u0435\u0454\u0438\u0456\u043e\ua64b\u0479\u0443\u0461\u044b\u0463\u044e\ua657\u0467\u0475\u047b]))`/g, '$15'], // ((?<=^[аеєиіоꙋѹуѡыѣюꙗѧѵѻ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][аеєиіоꙋѹуѡыѣюꙗѧѵѻ]))` --> 5
        [/((^[\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a]))(?![\u4444'`\^])/g, '$1#'], // ((?<=^[АЕИІОꙊѸѠЫѢЮꙖѦѴѺ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][АЕИІОꙊѸѠЫѢЮꙖѦѴѺ]))(?![䑄'`\^]) --> #
        [/((^[\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a]))'/g, '$1$$'], // ((?<=^[АЕИІОꙊѸѠЫѢЮꙖѦѴѺ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][АЕИІОꙊѸѠЫѢЮꙖѦѴѺ]))' --> $
        [/((^[\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a])|([^\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436'`\^~\u042a\u0427\u0414\u0413\u041d\u041e\u0420\u0421\u0412\u0425\u0417\u0416~#\$%\u0410\u0411\u0427\^\u0426U\u0414\u042a\u042c\u042b\u0415\u0424F\u0413@I\u0418VM\u042f\u042d\u042eZ\u041aX\u041b\u0423\u041c\u041dQW\u041eT_\u041fP\u0420\u0428\u0429\u0421C&\u0422\u0412O\u0425\u0405\u0417\u0416\?dg\\=b>c1345\u0430\u0431\u04476\u0446u\u0434\u044a\u044c\u044b\u0435\u0444f\u04332i\u0438vm\u044f\u044d\u044ez\u043ax\u043b\u0443\u043c\u043dqw\u043et8\u043fp\u0440\u0448\u0449\u04417\u0442\xb5\u0432\u0454o\u0445\u0455\u0437\u0436\+<\u20ac\u2022][\u0410\u0415\u0418\u0406\u041e\ua64a\u0478\u0460\u042b\u0462\u042e\ua656\u0466\u0474\u047a]))`/g, '$1%'], // ((?<=^[АЕИІОꙊѸѠЫѢЮꙖѦѴѺ])|(?<=[^АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖабчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж'`\^~ЪЧДГНОРСВХЗЖ~#\$%АБЧ\^ЦUДЪЬЫЕФFГ@IИVMЯЭЮZКXЛУМНQWОT_ПPРШЩСC&ТВOХЅЗЖ\?dg\\=b>c1345абч6цuдъьыефfг2iиvmяэюzкxлумнqwоt8пpршщс7тµвєoхѕзж\+<€•][АЕИІОꙊѸѠЫѢЮꙖѦѴѺ]))` --> %
        [/[=](.)\u4444/g, '$1'], // [=](?P<symb>.)䑄 --> \g<symb>
        [/\u4444/g, ''] // 䑄 -->
    ];

    var C = [
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])'/g, '$11'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])' 1
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])`/g, '$12'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])` 2
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\^/g, '$16'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])\^ 6
        [/3~/g, '~'], // 3~ ~
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])~/g,    '$17'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])~ 7
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u042a/g,  '$18'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Ъ 8
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0425/g,  '$1<'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Х <
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u041d/g,  '$1='], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Н =
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0420/g,  '$1>'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Р >
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0427/g,  '$1?'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Ч ?
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0412/g,  '$1+'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])В +
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u041e/g,  '$1b'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])О b
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0421/g,  '$1c'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])С c
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0414/g,  '$1d'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Д d
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0413/g,  '$1g'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Г g
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0417/g,  '$1\u20ac'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])З \u20ac
        [/([\u0430\u0431\u0447\u0446\u0479\u0434\u0131\u044a\u044c\u044b\u0435\u0444\u0473\u0433\u0456\u0438\u0475\ua657\u0463\u044e\u0467\u043a\u046f\u043b\ua64b\u043c\u043d\u047d\u0461\u043e\u047f\u043f\u0471\u0440\u0448\u0449\u0441\u0442\u0443\u0432\u0454\u047b\u0445\u0455\u0437\u0436])\u0416/g,  '$1\u2022'], // (?<=[абчцѹдıъьыефѳгіиѵꙗѣюѧкѯлꙋмнѽѡоѿпѱршщстувєѻхѕзж])Ж \u2022
        [/([\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416])`/g,   '$1@'], // (?<=[АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖ])` @
        [/([\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416])~/g,   '$1&'], // (?<=[АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖ])~ &
        [/([\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416])'/g,   '$1~'], // (?<=[АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖ])' ~
        [/([\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416])\^/g,  '$1^'], // (?<=[АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖ])\^ ^
        [/([\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416])\u042a/g,  '$1_'], // (?<=[АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖ])Ъ _
        [/([\u0410\u0411\u0427\u0426\u0478\u0414\u042a\u042c\u042b\u0415\u0424\u0472\u0413\u0406\u0418\u0474\ua656\u0462\u042e\u0466\u041a\u046e\u041b\ua64a\u041c\u041d\u047c\u0460\u041e\u047e\u041f\u0470\u0420\u0428\u0429\u0421\u0422\u0412\u0415\u047a\u0425\u0405\u0417\u0416])\u0421/g,  '$1C'], // (?<=[АБЧЦѸДЪЬЫЕФѲГІИѴꙖѢЮѦКѮЛꙊМНѼѠОѾПѰРШЩСТВЕѺХЅЗЖ])С C
        [/\u0472/g, 'F'], // Ѳ F
        [/\u0406/g, 'I'], // І I
        [/\u047a/g, 'O'], // Ѻ O
        [/\u0470/g, 'P'], // Ѱ P
        [/\u047c/g, 'Q'], // Ѽ Q
        [/\u047e/g, 'T'], // Ѿ T
        [/\u0478/g, 'U'], // Ѹ U
        [/\u0474/g, 'V'], // Ѵ V
        [/\u0460/g, 'W'], // Ѡ W
        [/\u046e/g, 'X'], // Ѯ X
        [/\u0466/g, 'Z'], // Ѧ Z
        [/\u0473/g, 'f'], // ѳ f
        [/\u0456/g, 'i'], // і i
        [/\u047b/g, 'o'], // ѻ o
        [/\u0471/g, 'p'], // ѱ p
        [/\u047d/g, 'q'], // ѽ q
        [/\u047f/g, 't'], // ѿ t
        [/\u0479/g, 'u'], // ѹ u
        [/\u0475/g, 'v'], // ѵ v
        [/\u0461/g, 'w'], // ѡ w
        [/\u046f/g, 'x'], // ѯ x
        [/\u0467/g, 'z'], // ѧ z
        [/\u0443/g, '\xb5'], // у µ
        [/\ua64a/g, '\u0423'], // Ꙋ У
        [/\u0462/g, '\u042d'], // Ѣ Э
        [/\ua656/g, '\u042f'], // Ꙗ Я
        [/\ua64b/g, '\u0443'], // ꙋ у
        [/\u0463/g, '\u044d'], // ѣ э
        [/\ua657/g, '\u044f'], // ꙗ я
        [/V(?=[#\$%&@\^~1234567])/g,  '\u7770'], // V(?=[#\$%&@\^~1234567]) 睰
        [/([\u0410\u0430\u0415\u0435\u0454])V/g,    '$1\u7770'], // (?<=[АаЕеє])V 睰
        [/([\u0410\u0430\u0415\u0435\u0454][#\$%&@\^~1234567])V/g,   '$1\u7770'], // (?<=[АаЕеє][#\$%&@\^~1234567])V 睰
        [/V/g,  'M'], // V M
        [/\u7770/g, 'V'], // 睰 V
        [/v(?=[#\$%&@\^~1234567])/g,    '\u7771'], // v(?=[#\$%&@\^~1234567]) 睱
        [/([\u0410\u0430\u0415\u0435\u0454])v/g,    '$1\u7771'], // (?<=[АаЕеє])v 睱
        [/([\u0410\u0430\u0415\u0435\u0454][#\$%&@\^~1234567])v/g,   '$1\u7771'], // (?<=[АаЕеє][#\$%&@\^~1234567])v 睱
        [/v/g,   'm'], // v m
        [/\u7771/g, 'v'], // 睱 v
        [/I(?![#\$%&@\^~C1234567\+gd\u2022\u20ac=b>c<\?])/g, '\u0406'], // I(?![#\$%&@\^~C1234567\+gd•€=b>c<\?]) І
        [/i(?![#\$%&@\^~C1234567\+gd\u2022\u20ac=b>c<\?])/g, '\u0456'], // i(?![#\$%&@\^~C1234567\+gd•€=b>c<\?]) і
        [/\u01317/g,    '\u2039'], // ı7 ‹
        [/\u0131/g,     'i'], // ı i
        [/z5/g,         '|'], // z5 |
        [/\u0410\$/g,    '\u0403'], // А\$ Ѓ
        [/\u04304/g,    '\u0453'], // а4 ѓ
        [/U\$/g,         '\u040c'], // U\$ Ќ
        [/U4/g,         '\u040c'], // U4 Ќ
        [/\u042f\$/g,    '\u040b'], // Я\$ Ћ
        [/O\$/g,         '\u040f'], // O\$ Џ
        [/u4/g,         '\u045c'], // u4 ќ
        [/\u044f4/g,    '\u045b'], // я4 ћ
        [/o4/g,         '\u045f'], // o4 џ
        [/I\$/g,         '\u0408'], // I\$ Ј
        [/i4/g,         '\u0458'], // i4 ј
        [/\u044f5/g,    '\xb1'], // я5 ±
        [/\u043e1/g,    '0'], // о1 0
        [/\u04367/g,    '9'], // ж7 9
        [/\u04302/g,    'A'], // а2 A
        [/\u044d6/g,    'B'], // э6 B
        [/\u0434c/g,    'D'], // дc D
        [/\u04352/g,    'E'], // е2 E
        [/\u04337/g,    'G'], // г7 G
        [/w1/g,         'H'], // w1 H
        [/i2/g,         'J'], // i2 J
        [/\u042f3/g,    'K'], // Я3 K
        [/\u043bd/g,    'L'], // лd L
        [/O#/g,         'N'], // O# N
        [/\u04407/g,    'R'], // р7 R
        [/z2/g,         'S'], // z2 S
        [/\u04432/g,    'Y'], // у2 Y
        [/\u04301/g,    'a'], // а1 a
        [/\u04351/g,    'e'], // е1 e
        [/\u044b1/g,    'h'], // ы1 h
        [/i1/g,         'j'], // i1 j
        [/\u044f3/g,    'k'], // я3 k
        [/\u043b7/g,    'l'], // л7 l
        [/o3/g,         'n'], // o3 n
        [/\u0440c/g,    'r'], // рc r
        [/z1/g,         's'], // z1 s
        [/\u04431/g,    'y'], // у1 y
        [/\u04436/g,    '{'], // у6 {
        [/\u04387/g,    '}'], // и7 }
        [/v1/g,         '\u0402'], // v1 Ђ
        [/x7/g,         '\u2026'], // x7 …
        [/\u04306/g,    '\u2020'], // а6 †
        [/i6/g,         '\u2021'], // i6 ‡
        [/z6/g,         '\u2030'], // z6 ‰
        [/Z#/g,         '\u0409'], // Z# Љ
        [/i7/g,         '\u2039'], // i7 ‹
        [/W#/g,         '\u040a'], // W# Њ
        [/vg/g,         '\u0452'], // vg ђ
        [/\u04427/g,    '\u2122'], // т7 ™
        [/z3/g,         '\u0459'], // z3 љ
        [/v6/g,         '\u203a'], // v6 ›
        [/w3/g,         '\u045a'], // w3 њ
        [/U#/g,         '\u040e'], // U# Ў
        [/U3/g,         '\u040e'], // U3 Ў
        [/u3/g,         '\u045e'], // u3 ў
        [/\u0410#/g,    '\u0490'], // А# Ґ
        [/\u04457/g,    '\xa6'], // х7 ¦
        [/\u04477/g,    '\xa7'], // ч7 §
        [/\u044d2/g,    '\u0401'], // э2 Ё
        [/\u04417/g,    '\xa9'], // с7 ©
        [/\u0440d/g,    '\xae'], // рd ®
        [/I#/g,         '\u0407'], // I# Ї
        [/\u04303/g,    '\u0491'], // а3 ґ
        [/\u044d1/g,    '\u0451'], // э1 ё
        [/\u04307/g,    '\u2116'], // а7 №
        [/i3/g,         '\u0457'] // i3 ї
    ];

    if (!isAffix) {
        // Полный набор правил конвертации
        var conversion = A.concat(B, C);
    } else {
        // Набор правил конвертации
        // без тех правил, что создают придыхания.
        // Предназначено для тех случаев, когда
        // необходимо отконвертировать, части слов,
        // например, окончания. Без данной опции
        // если часть слова начинается на гласную,
        // над ней неправильно возникает придыхание.
        var conversion = A.concat(C);
    }

    var conversion_len = conversion.length;

    var pattern, replacement;
    for (var i = 0; i < conversion_len; i++) {
        pattern     = conversion[i][0];
        replacement = conversion[i][1];
        ucs8_text   = ucs8_text.replace(pattern, replacement);
    }
    return ucs8_text;
}

function antconc_civilrus_word(word){
    var conversion = [
        // Все буквы -- строчные.
        [/'/g,              ''],        // '  -->
        [/`/g,              ''],        // `  -->
        [/\^/g,            ''],        // \^  -->
        [/\u0430\u043f\u0421\u043b/g,           '\u0430\u043f\u043e\u0441\u0442\u043e\u043b'],              // апСл  -->  апостол
        [/\u0430\u043f\u0421\u0442\u043e\u043b/g, '\u0430\u043f\u043e\u0441\u0442\u043e\u043b'],            // апСтол  -->  апостол
        [/\u0431\u0433~/g,                      '\u0431\u043e\u0433'],                                      // бг~  -->  бог
        [/\u0431\u0436~\u0442\u0432/g,          '\u0431\u043e\u0436\u0435\u0441\u0442\u0432'],              // бж~тв  -->  божеств
        [/\u0431\u0436~/g,                      '\u0431\u043e\u0436'],                                      // бж~  -->  бож
        [/\u0431\u0436\u0421\u0442\u0432/g,     '\u0431\u043e\u0436\u0435\u0441\u0442\u0432'],              // бжСтв  -->  божеств
        [/\u0431\u0437~/g,                      '\u0431\u043e\u0437'],                                      // бз~  -->  боз
        [/\u0431\u043b~\u0433/g,                '\u0431\u043b\u0430\u0433'],                                // бл~г  -->  благ
        [/\u0431\u043b~\u0436/g,                '\u0431\u043b\u0430\u0436'],                                // бл~ж  -->  блаж
        [/\u0431\u043b~\u0437/g,                '\u0431\u043b\u0430\u0437'],                                // бл~з  -->  блаз
        [/\u0431\u043b\u0413\u0432/g,           '\u0431\u043b\u0430\u0433\u043e\u0432'],                    // блГв  -->  благов
        [/\u0431\u043b\u0433\u0414\u0442/g,     '\u0431\u043b\u0430\u0433\u043e\u0434\u0430\u0442'],        // блгДт  -->  благодат
        [/\u0431\u043b\u0433\u0421\u0432/g,     '\u0431\u043b\u0430\u0433\u043e\u0441\u043b\u043e\u0432'],  // блгСв  -->  благослов
        [/\u0431\u043b\u0433\u0421\u043b/g,     '\u0431\u043b\u0430\u0433\u043e\u0441\u043b'],              // блгСл  -->  благосл
        [/\u0431\u043b\u0433\u0421/g,           '\u0431\u043b\u0430\u0433\u043e\u0441'],                    // блгС  -->  благос
        [/бчДен/g,                              'богородичен'],  // бчДен  -->  богородичен
        [/\u0431\u0446\u0414/g,                 '\u0431\u043e\u0433\u043e\u0440\u043e\u0434\u0438\u0446'],  // бцД  -->  богородиц
        [/\u0432\u043b\u0414\u043a/g,           '\u0432\u043b\u0430\u0434\u044b\u043a'],                    // влДк  -->  владык
        [/\u0432\u043b\u0414\u0446/g,           '\u0432\u043b\u0430\u0434\u044b\u0446'],                    // влДц  -->  владыц
        [/\u0432\u043b\u0414\u0447\u0446/g,     '\u0432\u043b\u0430\u0434\u044b\u0447\u0438\u0446'],        // влДчц  -->  владычиц
        [/\u0432\u043b\u0414\u0447/g,           '\u0432\u043b\u0430\u0434\u044b\u0447'],                    // влДч  -->  владыч
        [/\u0475\u0413\u043b/g,                 '\u0432\u0430\u043d\u0433\u0435\u043b'],                    // ѵГл  -->  вангел
        [/\u0475\u0413/g,                       '\u0432\u0430\u043d\u0433'],                                // ѵГ  -->  ванг
        [/\u0433\u0433[\u0435\u0454~]\u043b/g,  '\u043d\u0433\u0435\u043b'],                                // гг~л | ггел | ггєл  -->  нгел  > ангел...
        [/\u0433\u043b~/g,                      '\u0433\u043b\u0430\u0433\u043e\u043b'],                    // гл~  -->  глагол
        [/\u0433\u043b\u0412/g,                 '\u0433\u043b\u0430\u0432'],                                // глВ  -->  глав
        [/\u0433\u0434\u0421\u043d\u044c/g,     '\u0433\u043e\u0441\u043f\u043e\u0434\u0435\u043d\u044c'],  // гдСнь  -->  господень
        [/\u0433\u0434\u0421\u0432/g,           '\u0433\u043e\u0441\u043f\u043e\u0434\u0435\u0432'],        // гдСв  -->  господев
        [/\u0433\u0434\u0421/g,                 '\u0433\u043e\u0441\u043f\u043e\u0434'],                    // гдС  -->  господ
        [/\u0433\u043f\u0421\u0436/g,           '\u0433\u043e\u0441\u043f\u043e\u0436'],                    // гпСж  -->  госпож
        [/\u0434\u0432~\u0434/g,                '\u0434\u0430\u0432\u0438\u0434'],                          // дв~д  -->  давид
        [/\u0434\u0432~/g,                      '\u0434\u0435\u0432'],                                      // дв~  -->  дев
        [/\u0434\u0432\u0421\u0442\u0432/g,     '\u0434\u0435\u0432\u0441\u0442\u0432'],                    // двСтв  -->  девств
        [/\u0434\u0441~/g,                      '\u0434\u0443\u0441'],                                      // дс~  -->  дус
        [/\u0434\u0445~/g,                      '\u0434\u0443\u0445'],                                      // дх~  -->  дух
        [/\u0434\u0448~/g,                      '\u0434\u0443\u0448'],                                      // дш~  -->  душ
        [/\u0438~\u0441/g,                      '\u0438\u0441\u0443\u0441'],                                // и~с  -->  исус
        [/\u0456\u0438~\u043b/g,                '\u0438\u0437\u0440\u0430\u0438\u043b'],                    // іи~л  -->  израил
        [/\u043a\u0440~\u0441/g,                '\u043a\u0440\u0435\u0441'],                                // кр~с  -->  крес
        [/\u043a\u0440~\u0448/g,                '\u043a\u0440\u0435\u0448'],                                // кр~ш  -->  креш
        [/\u043a\u0440~\u0449/g,                '\u043a\u0440\u0435\u0449'],                                // кр~щ  -->  крещ
        [/\u043a\u0440\u0421\u0442/g,           '\u043a\u0440\u0435\u0441\u0442'],                          // крСт  -->  крест
        [/\u043a\u0440\u0421\u043d/g,           '\u043a\u0440\u0435\u0441\u0435\u043d\u0438'],              // крСні  -->  кресени
                                                                    // К сожалению ^ это правило не 100%-ное, потому что,
                                                                    // например, для формы ``воскрСнiи`` встречается как
                                                                    // предложный падеж существительного ВОСКРЕСЕНИЕ,
                                                                    // так и мн.ч. прилагательного ВОСКРЕСНЫЙ, хотя
                                                                    // последний случай довольно редкий. Также это правило
                                                                    // будет работать ещё хуже в текстах с ненормированной
                                                                    // орфографией.
        [/\u043a\u0440\u0421/g,                 '\u043a\u0440\u0435\u0441'],                                // крС  -->  крес
        [/\u043a\u0421\u0440/g,                 '\u043a\u0440\u0435\u0441'],                                // кСр  -->  крес
        [/\u043c\u0414\u0440/g,                 '\u043c\u0443\u0434\u0440'],                                // мДр  -->  мудр
        [/\u043c\u043b~\u0442\u0432/g,          '\u043c\u043e\u043b\u0438\u0442\u0432'],                    // мл~тв  -->  молитв
        [/\u043c\u043b\u0414\u043d\u0446\u044a/g,   '\u043c\u043b\u0430\u0434\u0435\u043d\u0435\u0446'],    // млДнцъ  -->  младенец
        [/\u043c\u043b\u0414\u043d/g,           '\u043c\u043b\u0430\u0434\u0435\u043d'],                    // млДн  -->  младен
        [/\u043c\u043b\u0421\u0440\u0434/g,     '\u043c\u0438\u043b\u043e\u0441\u0435\u0440\u0434'],        // млСрд  -->  милосерд
        [/\u043c\u043b\u0421\u0442/g,           '\u043c\u0438\u043b\u043e\u0441\u0442'],                    // млСт  -->  милост
        [/\u043c\u043b\u0421/g,                 '\u043c\u0438\u043b\u043e\u0441'],                          // млС  -->  милос
        [/\u043c\u0442~\u0440/g,                '\u043c\u0430\u0442\u0435\u0440'],                          // мт~р  -->  матер
        [/\u043c\u0442~/g,                      '\u043c\u0430\u0442'],                                      // мт~  -->  мат
        [/\u043c\u0440~\u0456/g,                '\u043c\u0430\u0440\u0438'],                                // мр~і  -->  мари
        [/\u043c\u0420\u043a/g,                 '\u043c\u044f\u0440\u0435\u043a'],                          // мРк  -->  мярек
        [/\u043c\u0447~\u043d\u043a/g,          '\u043c\u0443\u0447\u0435\u043d\u0438\u043a'],              // мч~нк  -->  мученик
        [/\u043c\u0447~\u043d\u0446/g,          '\u043c\u0443\u0447\u0435\u043d\u0438\u0446'],              // мч~нц  -->  мучениц
        [/\u043c\u0447~\u043d\u0447/g,          '\u043c\u0443\u0447\u0435\u043d\u0438\u0447'],              // мч~нч  -->  мученич
        [/\u043c\u0447~\u043d/g,                '\u043c\u0443\u0447\u0435\u043d'],                          // мч~н  -->  мучен
        [/\u043c\u0446\u0421/g,                 '\u043c\u0435\u0441\u044f\u0446'],                          // мцС  -->  месяц
        [/\u043d\u0431~\u0441/g,                '\u043d\u0435\u0431\u0435\u0441'],                          // нб~с  -->  небес
        [/\u043d\u0431\u0421\u0441/g,           '\u043d\u0435\u0431\u0435\u0441'],                          // нбCс  -->  небес
        [/\u043d\u0431\u0421/g,                 '\u043d\u0435\u0431\u0435\u0441'],                          // нбC  -->  небес
        [/\u043d\u0431~/g,                      '\u043d\u0435\u0431'],                                      // нб~  -->  неб
        [/\u043d\u043b\u0414/g,                 '\u043d\u0435\u0434\u0435\u043b'],                          // нлД  -->  недел
        [/\u043d\u043d~/g,                      '\u043d\u044b\u043d'],                                      // нн~  -->  нын
        [/\u047b'\u0447~\u044c/g,               '\u043e\u0442\u0435\u0447\u044c'],                          // ѻ'ч~ь  -->  отечь
        [/\u047b'\u0447~\u0454\u0441/g,         '\u043e\u0442\u0435\u0447\u0435\u0441'],                    // ѻ'ч~єс  -->  отечес
        [/\u047b'\u0447~\u0435\u0441/g,         '\u043e\u0442\u0435\u0447\u0435\u0441'],                    // ѻ'ч~ес  -->  отечес
        [/\u047b'\u0447~/g,                     '\u043e\u0442\u0447'],                                      // ѻ'ч~  -->  отч
        [/\u047b\u0446~\u044a/g,                '\u043e\u0442\u0435\u0446'],                                // ѻц~ъ  -->  отец
        [/\u047b\u0446~/g,                      '\u043e\u0442\u0446'],                                      // ѻц~  -->  отц
        [/праЗ/g,                               'праз.'],   // праз[дник(а,у...)]
        [/\u043f\u0440\u0432\u0414\u043d\u044a/g,   '\u043f\u0440\u0430\u0432\u0435\u0434\u0435\u043d'],    // првДнъ  -->  праведен
        [/\u043f\u0440\u0432\u0414\u043d/g,     '\u043f\u0440\u0430\u0432\u0435\u0434\u043d'],              // првДн  -->  праведн
        [/\u043f\u0440\u0414\u0442\u0447/g,     '\u043f\u0440\u0435\u0434\u0442\u0435\u0447'],              // прДтч  -->  предтеч
        [/\u043f\u0440\u0414\u0442/g,           '\u043f\u0440\u0435\u0434\u0442'],                          // прДт  -->  предт
        [/\u043f\u0440\u043f\u0414\u0431/g,     '\u043f\u0440\u0435\u043f\u043e\u0434\u043e\u0431'],        // прпДб  -->  преподоб
        [/\u043f\u0440\u0435\u043f\u0414\u0431/g, '\u043f\u0440\u0435\u043f\u043e\u0434\u043e\u0431'],      // препДб  -->  преподоб
        [/\u043f\u0440\u041e\u0440/g,           '\u043f\u0440\u043e\u0440'],                                // прОр  -->  прор
        [/\u043f\u0440\u0421\u043d/g,           '\u043f\u0440\u0438\u0441\u043d'],                          // прСн  -->  присн
        [/\u043f\u0440\u0421\u0442/g,           '\u043f\u0440\u0435\u0441\u0442'],                          // прСт  -->  прест
        [/\u043f\u0440\u0447\u0421\u0442/g,     '\u043f\u0440\u0435\u0447\u0438\u0441\u0442'],              // прчСт  -->  пречист
        [/\u043f\u0421\u043a\u043f/g,           '\u043f\u0438\u0441\u043a\u043e\u043f'],                    // пСкп  -->  пископ
        [/\u043f\u0421\u043a/g,                 '\u043f\u0438\u0441\u043a'],                                // пСк  -->  писк
        [/\u0440\u0436\u0421\u0442\u0432/g,     '\u0440\u043e\u0436\u0434\u0435\u0441\u0442\u0432'],        // ржСтв  -->  рождеств
        [/\u0440\u0421\u043b/g,                 '\u0440\u0443\u0441\u0430\u043b'],                          // рСл  -->  русал
        [/\u0441\u043b~\u043d\u0446/g,          '\u0441\u043e\u043b\u043d\u0446'],                          // сл~нц  -->  солнц
        [/\u0441\u043d~/g,                      '\u0441\u044b\u043d'],                                      // сн~  -->  сын
        [/\u0441\u043f~\u0441/g,                '\u0441\u043f\u0430\u0441'],                                // сп~с  -->  спас
        [/\u0441\u043f\u0421\u043d/g,           '\u0441\u043f\u0430\u0441\u0435\u043d'],                    // спСн  -->  спасен
        [/\u0441\u043f\u0421/g,                 '\u0441\u043f\u0430\u0441'],                                // спС  -->  спас
        [/\u0441\u0440\u0414\u0446/g,           '\u0441\u0435\u0440\u0434\u0446'],                          // срДц  -->  сердц
        [/\u0441\u0440\u0414\u0447/g,           '\u0441\u0435\u0440\u0434\u0435\u0447'],                    // срДч  -->  сердеч
        [/\u0441\u0442~/g,                      '\u0441\u0432\u044f\u0442'],                                // ст~  -->  свят
        [/\u0441\u0442\u0440\u0421\u0442/g,     '\u0441\u0442\u0440\u0430\u0441\u0442'],                    // стрСт  -->  страст
        [/\u0441\u0425/g,                       '\u0441\u0442\u0438\u0445'],                                // сХ  -->  стих
        [/\u0441\u0442\u0425\u0440/g,           '\u0441\u0442\u0438\u0445\u0438\u0440'],                    // стХр  -->  стихир
        [/\u0441\u0449~/g,                      '\u0441\u0432\u044f\u0449'],                                // сщ~  -->  свящ
        [/\u0442\u0440\u041e\u0446/g,           '\u0442\u0440\u043e\u0438\u0446'],                          // трОц  -->  троиц
        [/\u0442\u0440\u041e\u0447/g,           '\u0442\u0440\u043e\u0438\u0447'],                          // трОч  -->  троич
        [/\u0442\u0440\u0421\u0442/g,           '\u0442\u0440\u0438\u0441\u0432\u044f\u0442'],              // трСт  -->  трисвят
        [/\u0445\u0440\u0421\u0442/g,           '\u0445\u0440\u0438\u0441\u0442'],                          // хрСт  -->  христ
        [/\u0446\u0440~\u043a/g,                '\u0446\u0435\u0440\u043a'],            // цр~к  -->  церк
        [/\u0446\u0440~/g,                      '\u0446\u0430\u0440'],                  // цр~  -->  цар
        [/\u0446\u0440\u0421/g,                 '\u0446\u0430\u0440\u0441'],            // црС  -->  царс
        [/\u0446\u0421\u0440/g,                 '\u0446\u0430\u0440\u0441'],            // цСр  -->  царс
        [/\u0447\u043b~\u0432/g,                '\u0447\u0435\u043b\u043e\u0432'],      // чл~в  -->  челов
        [/\u0447~\u043d\u043a/g,                '\u0447\u0435\u043d\u0438\u043a'],      // ч~нк  -->  ченик
        [/\u0447~\u043d\u0446/g,                '\u0447\u0435\u043d\u0438\u0446'],      // ч~нц  -->  чениц
        [/\u0447~\u0442\u043b/g,                '\u0447\u0438\u0442\u0435\u043b'],      // ч~тл  -->  чител
        [/\u0447\u043d~\u043a/g,                '\u0447\u0435\u043d\u0438\u043a'],      // чн~к  -->  ченик
        [/\u0447\u043d~\u0446/g,                '\u0447\u0435\u043d\u0438\u0446'],      // чн~ц  -->  чениц
        [/\u0447\u043d~/g,                      '\u0447\u0435\u043d'],                  // чн~  -->  чен
        [/\u0447\u0421\u0442\u043d/g,           '\u0447\u0435\u0441\u0442\u043d'],      // чСтн  -->  честн
        [/\u0447\u0442\u0421\u043d/g,           '\u0447\u0435\u0441\u0442\u043d'],      // чтСн  -->  честн
        [/\u0447\u0421\u0442/g,                 '\u0447\u0438\u0441\u0442'],            // чСт  -->  чист
        [/\u0447\u0442\u0421/g,                 '\u0447\u0438\u0441\u0442'],            // чтС  -->  чист
        [/\u0447\u0442~\u043b/g,                '\u0447\u0438\u0442\u0435\u043b'],      // чт~л  -->  чител
        [/\u0454/g,         '\u0435'], // є  -->  е
        [/\u0455/g,         '\u0437'], // ѕ  -->  з
        [/\u0456/g,         '\u0438'], // і  -->  и
        [/\ua64b/g,         '\u0443'], // ꙋ  -->  у
        [/\u0479/g,         '\u0443'], // ѹ  -->  у
        [/\u0461/g,         '\u043e'], // ѡ  -->  о
        [/\u0463/g,         '\u0435'], // ѣ  -->  е
        [/\ua657/g,         '\u044f'], // ꙗ  -->  я
        [/\u0467/g,         '\u044f'],          // ѧ  -->  я
        [/\u046f/g,         '\u043a\u0441'],    // ѯ  -->  кс
        [/\u0471/g,         '\u043f\u0441'],    // ѱ  -->  пс
        [/\u0473/g,         '\u0444'],          // ѳ  -->  ф
        [/\u0430\u0475/g,   '\u0430\u0432'],    // аѵ  -->  ав
        [/\u0435\u0475/g,   '\u0435\u0432'],    // еѵ  -->  ев
        [/\u0454\u0475/g,   '\u0435\u0432'],    // єѵ  -->  ев
        [/\u0475/g,         '\u0438'],          // ѵ  -->  и
        [/\u047b/g,         '\u043e'],          // ѻ  -->  о
        [/\u047d/g,         '\u043e'],          // ѽ  -->  о
        [/\u047f/g,         '\u043e\u0442'],    // ѿ  -->  от
        [/~/g,              '*'],       // ~  -->  *
        [/\u042a/g,         '\u044a'],  // Ъ  -->  ъ
        [/\u0412/g,         '*'],       // В  -->  *
        [/\u0413/g,         '*'],       // Г  -->  *
        [/\u0414/g,         '*'],       // Д  -->  *
        [/\u0416/g,         '*'],       // Ж  -->  *
        [/\u0417/g,         'з'],       // З  -->  з
        [/\u041d/g,         '*'],       // Н  -->  *
        [/\u041e/g,         '*'],       // О  -->  *
        [/\u0420/g,         '*'],       // Р  -->  *
        [/\u0421/g,         '*'],       // С  -->  *
        [/\u0425/g,         '\u0445'],  // Х  -->  х
        [/\u0427/g,         '*'],       // Ч  -->  *
        [/\u044a$/g,        ''],        // ъ$  -->
        [/\u044a\s/g,       ' '],       // ъ\s -->
        [/\u044a\u0430/g,   '\u0430'],  // ъа  -->  а
        [/\u044a\u043e/g,   '\u043e'],  // ъо  -->  о
        [/\u044a\u0443/g,   '\u0443'],  // ъу  -->  у
        [/\u044a\u044b/g,   '\u044b'],  // ъы  -->  ы
        [/\u044a\u0438/g,   '\u044b'],  // ъи  -->  ы
    ];
    var conversion_len = conversion.length;

    var pattern, replacement;
    for (var i = 0; i < conversion_len; i++) {
        pattern     = conversion[i][0];
        replacement = conversion[i][1];
        word = word.replace(pattern, replacement);
    }
    return word;
}
